Repository: aowendev/docstatic
Catalog: *-translations.xlf
Languages: fr

# Getting-started---working-locally
source: # Getting started for working with DocStatic locally Welcome! This guide walks you through setting up DocStatic for the first time. If you’ve never worked with GitHub or docs-as-code before, don’t worry — we’ll explain what’s needed, why, and where to find more detail. ## Prerequisites You can run DocStatic locally (on your computer) or host it in the cloud. Here, we explain how to set it up to work locally. Before you begin, you'll need: - GitHub — create a free account. GitHub will store your content and track changes. - An Integrated Development Environment (IDE) or a text editor. Two open-source options are:- Eclipse - VSCodium When you have those in place, you can begin the installation (as described in this article). --- ## Install Node.js You need to install Node.js version 18.0 or above as DocStatic uses its build tools. First, check if you have Node.js installed already: 1. Open a terminal (Command Prompt or Terminal app). 2. Run: If you see a version number starting with **v18 or higher**, you already have a suitable version of Node.js installed. If Node.js is **not installed** or you have an **older version**: 1. Go to the official Node.js downloads page. 2. Choose the LTS (Long-Term Support) version for your operating system. The installer includes npm, the Node Package Manager, which you'll need in later steps. 3. During installation:- Keep the default options selected (these include required dependencies) - When the installer finishes, close and reopen your terminal. 4. (Optional) if you work on different projects that need different Node versions, install nvm (Node Version Manager). With nvm, you can switch between versions of Node without breaking your setup. Next: Install Yarn. --- ## Install Yarn DocStatic uses Yarn for package management. Check if Yarn is already installed. 1. Open your terminal or command prompt. 2. Type: If you see a version number, Yarn is already installed. If you get a “command not found” message or similar error: 1. Open a terminal (Command Prompt or Terminal app) 2. Run: (jsx:Admonition type="note" title="Note") (type:note, title:Note)On macOS or Linux, you might need to prefix the command with sudo to grant permission: }(/jsx:Admonition)On macOS or Linux, you might need to prefix the command with sudo to grant permission: </Admonition> (jsx:Admonition type="note" title="Note") (type:note, title:Note)On Windows, you don’t use sudo. Just open your terminal as Administrator and run the command.}(/jsx:Admonition)On Windows, you don’t use sudo. Just open your terminal as Administrator and run the command.</Admonition> Next: Fork the DocStatic repository --- ## Fork the DocStatic repository DocStatic’s source code lives on GitHub. To start, you’ll need to fork the repository. When you fork a repository, you create your own personal copy of it in GitHub. As it is your own copy, you have management rights for it and can to push content into it. This is how you work on a repository without affecting the original DocStatic repository. 1. Log in to your account in GitHub. 2. Visit https://github.com/aowendev/docstatic. 3. Click **Fork** (it is usually to the top-right). 4. Leave the default **Repository name** in place. 5. Enter a description of your project. 6. Make sure **Copy the main branch only** is checked. 7. Click **Create fork**. GitHub makes a new branch of the repository in your GitHub account. Next: Clone your fork. --- ## Clone your fork of the DocStatic repository Cloning allows you to work locally on content that you will push to your fork on GitHub. - Fork = ownership on GitHub - Clone = ability to work locally To create a clone: 1. Log in to your GitHub account. 2. Navigate to the repository for the fork. 3. Click on the repository to open it. 4. Click on **<> Code** and then copy the url. 5. Open your terminal or command prompt. 6. Use cd to navigate to the location where you want to store the clone. For example, cd Documents/Projects/. 7. Enter git clone followed by the url of your clone. Next: Install the project dependencies. --- ## Install the project dependencies To work locally, you also need to install the project dependencies. 1. Open your terminal or command prompt. 2. Use cd to navigate to the root folder of your cloned or forked DocStatic repository and install the packages: Yarn will download everything listed in package.json. This may take a few minutes. You've now set everything up. Next, let's look at the project structure. --- ## Project structure After forking and cloning the repository, you will see various files in your in your docstatic/ folder. Below, we've included **some** of the project structure files and folders that you need to be aware of. **It is not a complete list of everything in the project**. ### Project structure rundown - /apis/ - OpenAPI YAML files. - /blog/ - Blog MDX files. - /config/ - JSON files used by TinaCMS to configure DocStatic. - /docs/ - Docs MDX files. - /i18n/ - Translation files. - /reuse/ - Reusable content. - /src/ - Non-documentation files like pages or custom React components.- /src/pages - Any JSX/TSX/MDX file within this directory are converted into a website page. - /static/ - Static folder. Any content inside here is copied into the root of the final build folder. - /docusaurus.config.ts - A config file containing the site configuration. - /package.json - A DocStatic website is a React app. You can install and use any npm packages you want. - /sidebars.ts - Specifies the order of documents in the sidebar. Use this for your “table of contents” structure. Next, let's look at where you'll need to create and store your documentation files. --- ## Clear the Docs folder The Docs folder contains a copy of the DocStatic documentation. The idea is that you clear out the DocStatic documentation. When you create your own documentation, you should save it to the Docs folder. --- ## Monorepos DocStatic allows the use of a single repo that contains both the project code and the project documentation. In Docusaurus terminology, this concept is called a “monorepo”. For more information, see Monorepos in the Docusaurus documentation. --- ## Preview changes To preview your changes as you edit the files, you can run a **local development server** that will serve your website and reflect the latest changes. Open a terminal or command prompt and enter: By default, a browser window will open at http://localhost:3000. --- ## Build DocStatic uses a static site generator to build the website into a folder of static contents and put it on a web server where it can be viewed. To build the website, use: The contents are generated in the /build folder, which you can copy to any static file hosting service such as GitHub pages, Netlify or Vercel. For more information, refer to Deployment in the Docusaurus documentation.
fr: # Getting started for working with DocStatic locally Welcome! This guide walks you through setting up DocStatic for the first time. If you’ve never worked with GitHub or docs-as-code before, don’t worry — we’ll explain what’s needed, why, and where to find more detail. ## Prerequisites You can run DocStatic locally (on your computer) or host it in the cloud. Here, we explain how to set it up to work locally. Before you begin, you'll need: - GitHub — create a free account. GitHub will store your content and track changes. - An Integrated Development Environment (IDE) or a text editor. Two open-source options are:- Eclipse - VSCodium When you have those in place, you can begin the installation (as described in this article). --- ## Install Node.js You need to install Node.js version 18.0 or above as DocStatic uses its build tools. First, check if you have Node.js installed already: 1. Open a terminal (Command Prompt or Terminal app). 2. Run: If you see a version number starting with **v18 or higher**, you already have a suitable version of Node.js installed. If Node.js is **not installed** or you have an **older version**: 1. Go to the official Node.js downloads page. 2. Choose the LTS (Long-Term Support) version for your operating system. The installer includes npm, the Node Package Manager, which you'll need in later steps. 3. During installation:- Keep the default options selected (these include required dependencies) - When the installer finishes, close and reopen your terminal. 4. (Optional) if you work on different projects that need different Node versions, install nvm (Node Version Manager). With nvm, you can switch between versions of Node without breaking your setup. Next: Install Yarn. --- ## Install Yarn DocStatic uses Yarn for package management. Check if Yarn is already installed. 1. Open your terminal or command prompt. 2. Type: If you see a version number, Yarn is already installed. If you get a “command not found” message or similar error: 1. Open a terminal (Command Prompt or Terminal app) 2. Run: <Admonition type="note" title="Note" children={On macOS or Linux, you might need to prefix the command with sudo to grant permission: }>On macOS or Linux, you might need to prefix the command with sudo to grant permission: </Admonition> <Admonition type="note" title="Note" children={On Windows, you don’t use sudo. Just open your terminal as Administrator and run the command.}>On Windows, you don’t use sudo. Just open your terminal as Administrator and run the command.</Admonition> Next: Fork the DocStatic repository --- ## Fork the DocStatic repository DocStatic’s source code lives on GitHub. To start, you’ll need to fork the repository. When you fork a repository, you create your own personal copy of it in GitHub. As it is your own copy, you have management rights for it and can to push content into it. This is how you work on a repository without affecting the original DocStatic repository. 1. Log in to your account in GitHub. 2. Visit https://github.com/aowendev/docstatic. 3. Click **Fork** (it is usually to the top-right). 4. Leave the default **Repository name** in place. 5. Enter a description of your project. 6. Make sure **Copy the main branch only** is checked. 7. Click **Create fork**. GitHub makes a new branch of the repository in your GitHub account. Next: Clone your fork. --- ## Clone your fork of the DocStatic repository Cloning allows you to work locally on content that you will push to your fork on GitHub. - Fork = ownership on GitHub - Clone = ability to work locally To create a clone: 1. Log in to your GitHub account. 2. Navigate to the repository for the fork. 3. Click on the repository to open it. 4. Click on **<> Code** and then copy the url. 5. Open your terminal or command prompt. 6. Use cd to navigate to the location where you want to store the clone. For example, cd Documents/Projects/. 7. Enter git clone followed by the url of your clone. Next: Install the project dependencies. --- ## Install the project dependencies To work locally, you also need to install the project dependencies. 1. Open your terminal or command prompt. 2. Use cd to navigate to the root folder of your cloned or forked DocStatic repository and install the packages: Yarn will download everything listed in package.json. This may take a few minutes. You've now set everything up. Next, let's look at the project structure. --- ## Project structure After forking and cloning the repository, you will see various files in your in your docstatic/ folder. Below, we've included **some** of the project structure files and folders that you need to be aware of. **It is not a complete list of everything in the project**. ### Project structure rundown - /apis/ - OpenAPI YAML files. - /blog/ - Blog MDX files. - /config/ - JSON files used by TinaCMS to configure DocStatic. - /docs/ - Docs MDX files. - /i18n/ - Translation files. - /reuse/ - Reusable content. - /src/ - Non-documentation files like pages or custom React components.- /src/pages - Any JSX/TSX/MDX file within this directory are converted into a website page. - /static/ - Static folder. Any content inside here is copied into the root of the final build folder. - /docusaurus.config.ts - A config file containing the site configuration. - /package.json - A DocStatic website is a React app. You can install and use any npm packages you want. - /sidebars.ts - Specifies the order of documents in the sidebar. Use this for your “table of contents” structure. Next, let's look at where you'll need to create and store your documentation files. --- ## Clear the Docs folder The Docs folder contains a copy of the DocStatic documentation. The idea is that you clear out the DocStatic documentation. When you create your own documentation, you should save it to the Docs folder. --- ## Monorepos DocStatic allows the use of a single repo that contains both the project code and the project documentation. In Docusaurus terminology, this concept is called a “monorepo”. For more information, see Monorepos in the Docusaurus documentation. --- ## Preview changes To preview your changes as you edit the files, you can run a **local development server** that will serve your website and reflect the latest changes. Open a terminal or command prompt and enter: By default, a browser window will open at http://localhost:3000. --- ## Build DocStatic uses a static site generator to build the website into a folder of static contents and put it on a web server where it can be viewed. To build the website, use: The contents are generated in the /build folder, which you can copy to any static file hosting service such as GitHub pages, Netlify or Vercel. For more information, refer to Deployment in the Docusaurus documentation.

# guides/markdown-features/glossary
source: # Glossary terms The **Glossary Term** component enables you to enter a key that maps to a localized term and description. The term is displayed underlined. Moving the cursor over the term shows the help cursor, and hovering displays the description as a tooltip. On touch-screen devices, tapping the term displays a pop-up definition. ## Managing glossary terms You can edit the Glossary Terms collection in the CMS. 1. Click the **Add** icon ( **+** ) to add a new **Key**. 2. Edit the key and then click the **Add** icon ( **+** ) to add a new **Translation**. 3. Edit the translation. 4. Give it a **Language Code**. 5. Enter how the **Term** should appear in the text. 6. **Enter the Definition.** The Glossary Term will use the language version for the page it is displayed on. If no definition exists, it will fall back to the source language. ## Using glossary terms 1. Select **Glossary Term** from the **Embed** list. 2. Edit the component. 3. Enter the **Key**. #### Example (jsx:GlossaryTerm termKey="single-sourcing" initcap) (termKey:single-sourcing)(/jsx:GlossaryTerm)
fr: # Glossaire Le composant **Terme du glossaire** vous permet de saisir une clé qui correspond à un terme localisé et à une description. Le terme est souligné. Le passage du curseur sur le terme fait apparaître le curseur d'aide, et le survol affiche la description sous forme d'infobulle. Sur les appareils à écran tactile, le fait d'appuyer sur le terme affiche une définition dans une fenêtre contextuelle. ## Gestion des termes du glossaire Vous pouvez modifier la collection de termes du glossaire dans le CMS. 1. Cliquez sur l'icône **Add** ( **+** ) pour ajouter une nouvelle **Key**. 2. Modifiez la clé, puis cliquez sur l'icône **Add** ( **+** ) pour ajouter une nouvelle **Translation**. 3. Modifiez la traduction. 4. Donnez-lui un **Language Code**. 5. Indiquez comment le **Term** doit apparaître dans le texte. 6. Saisissez la **Definition**. Le terme du glossaire utilisera la version linguistique de la page sur laquelle il est affiché. S'il n'existe pas de définition, la langue source sera utilisée. ## Utiliser les termes du glossaire 1. Sélectionnez **Glossary Term** dans la liste **Embed**. 2. Modifiez le composant. 3. Saisissez la **Key**. #### Exemple <GlossaryTerm termKey="single-sourcing"></GlossaryTerm>

# guides
source: Learn about the most important DocStatic concepts. (jsx:DocCardList title="Guides") (title:Guides)(/jsx:DocCardList)
fr: Découvrez les concepts les plus importants de DocStatic. <DocCardList title="Guides"></DocCardList>

# guides/markdown-features/metadata
source: # Head metadata DocStatic automatically sets useful page metadata in <html>, <head> and <body> for you. It is possible to add extra metadata (or override existing ones) with the <head> tag in Markdown files. In the CMS, this must be added in the Markdown editor. It will not be recognized if you wrap it in the **Passthrough** component. For more information, refer to Head metadata in the Docusaurus documentation.
fr: # Métadonnées d'entête DocStatic définit automatiquement pour vous des métadonnées utiles dans <html>, <head> et <body>. Il est possible d'ajouter des métadonnées supplémentaires (ou de remplacer les métadonnées existantes) avec la balise <head> dans les fichiers Markdown. Dans le CMS, ces métadonnées doivent être ajoutées dans l'éditeur Markdown. Elle ne sera pas reconnue si vous l'intégrez dans le composant **Passthrough**. Pour plus d'informations, voir Métadonnées d'entête dans la documentation de Docusaurus.

# guides/markdown-features/toc
source: # Headings and table of contents In the CMS you can select **Paragraph** or **Heading** level (from 1 to 6). <a id="anchor-example"></a> ## Heading IDs Heading IDs are generated automatically. For example, heading-ids. You can use these to link directly to topic headings. However, if you change the title of the heading, the link will break. For this reason, DocStatic provides the **Context Help** component. This embeds an anchor tag anywhere on a page, not just at a heading. 1. Select **Context Help** from the **Embed** list. 2. Edit the component and give it a **Context Help ID**. To link to the anchor, use the path: <URL>/docs/<slug>#<ID>. For example: https://docstatic.com/docs/guides/markdown-features/toc#anchor-example ## Table of contents heading level Each Markdown document displays a table of contents in the top-right corner. By default, this table only shows h2 and h3 headings, which should be sufficient for an overview of the page structure. In case you need to change the range of headings displayed, you can customize the minimum and maximum heading level, either per page or globally. For more information, refer to Headings and Table of contents in the Docusaurus documentation.
fr: # Titres et table des matières Dans le CMS, vous pouvez sélectionner le niveau **Paragraphe** ou **Titre** (de 1 à 6). <a id="anchor-example"></a> ## ID des rubriques Les identifiants des titres sont générés automatiquement. Par exemple, heading-ids. Vous pouvez les utiliser pour établir un lien direct avec les titres des rubriques. Cependant, si vous changez le titre de la rubrique, le lien sera rompu. C'est pourquoi DocStatic fournit le composant **Aide contextuelle**. Ce composant permet d'insérer une balise d'ancrage n'importe où sur une page, et simultanément dans un titre. 1. Sélectionnez **Context Help** dans la liste **Embed**. 2. Modifiez le composant et donnez-lui un **Context Help ID**. Pour créer un lien vers l'ancre, utilisez le chemin d'accès : <URL>/docs/<slug>#<ID>. Par exemple : https://docstatic.com/docs/fr/guides/markdown-features/toc#anchor-example ## Niveau de l'en-tête de la table des matières Chaque document Markdown affiche une table des matières dans le coin supérieur droit. Par défaut, cette table n'affiche que les titres h2 et h3, ce qui devrait être suffisant pour avoir une vue d'ensemble de la structure de la page. Si vous souhaitez modifier l'étendue des titres affichés, vous pouvez personnaliser le niveau minimum et maximum des titres, soit par page, soit globalement. Pour plus d'informations, reportez-vous à Entêtes et table des matières dans la documentation de Docusaurus.

# advanced/hosted-cms
source: # Hosted CMS One of the two core components of DocStatic is the CMS (the other is the SSG). Until now, you have most likely used only the local version, invoked from the command line with yarn dev. But DocStatic also supports two ways of using a hosted version of the CMS. ## TinaCloud The easiest hosted CMS option is TinaCloud. You can register for a free account, connect it to your GitHub repository and start using it immediately. The free tier suports up to two users, which may be sufficient for lone writers and small docs teams. If you need more users, Tina offers a variety of pricing plans for different budgets. ## Self hosted Because TinaCMS is open-source, you have the option of self-hosting. In this case there are no subscription fees, but you will need a development team to set up your Tina instance and you'll have to provide your own support.
fr: # CMS hébergé L'un des deux composants principaux de DocStatic est le CMS (l'autre étant le SSG). Jusqu'à présent, vous n'avez probablement utilisé que la version locale, invoquée à partir de la ligne de commande avec yarn dev. Mais, DocStatic supporte également deux façons d'utiliser une version hébergée du CMS. ## TinaCloud L'option de CMS hébergé la plus simple est TinaCloud. Vous pouvez vous inscrire pour un compte gratuit, le connecter à votre dépôt GitHub et commencer à l'utiliser immédiatement. La version gratuite prend en charge jusqu'à deux utilisateurs, ce qui peut être suffisant pour les rédacteurs isolés et les petites équipes de documentation. Si vous avez besoin de plus d'utilisateurs, Tina propose une variété de plans tarifaires pour différents budgets. ## Auto-hébergé TinaCMS étant un logiciel libre, vous pouvez de l'auto-héberger. Dans ce cas, aucuns frais n'existent d'abonnement. Vous aurez besoin d'une équipe de développement pour mettre en place votre instance de Tina et vous devrez fournir votre propre support.
