Repository: aowendev/docstatic
Catalog: *-translations.xlf
Languages: fr

# advanced/adding-the-cms-to-an-ipad-home-screen
source: With Apple iPadOS you can convert any web page into a web app that runs in its own instance of Safari with its own icon on your home screen. You can use this ability to create an app for the cloud hosted CMS. 1. Sign in to the CMS. 2. Navigate to the collection you want to use as the home page. For example, the **Topics** collection or the **Table of Contents**. 3. Tap the **Share** icon, tap **More** ( **…** ) and tap **Add to Home Screen** ( **+** ). 4. Give the app a name. By default it will use TinaCMS. 5. Click **Add**.
fr: Avec l'iPadOS d'Apple, vous pouvez convertir n'importe quelle page web en une application web qui s'exécute dans sa propre instance de Safari avec sa propre icône sur votre écran d'accueil. Vous pouvez utiliser cette capacité pour créer une application pour le CMS hébergé dans le nuage. 1. Connectez-vous au CMS. 2. Naviguez jusqu'à la collection que vous souhaitez utiliser comme page d'accueil. Par exemple, la collection **Topics** ou la **Table of Contents**. 3. Appuyez sur l'icône **Partager**, appuyez sur **Plus** ( **…** ) et appuyez sur **Ajouter à l'écran d'accueil** ( **+** ). 4. Donnez un nom à l'application. Par défaut, elle utilisera TinaCMS. 5. Cliquez sur **Ajouter**.

# guides/markdown-features/admonitions
source: # Admonitions The **Admonitions** component enables you to add styled admonitions. 1. Select **Admonition** from the **Embed** list. 2. Edit the component and select a **Type** (**Note**, **Tip**, **Info**, **Caution** or **Warning**). 3. Give it a **Title**. 4. Enter the **Content**. #### Examples: (jsx:Admonition type="note" title="Note") (type:note, title:Note)Use note admonitions for supplementary information.}(/jsx:Admonition)Use note admonitions for supplementary information.</Admonition> (jsx:Admonition type="tip" title="Tip") (type:tip, title:Tip)Use tip admonitions to provide advice that it's safe to ignore.}(/jsx:Admonition)Use tip admonitions to provide advice that it's safe to ignore.</Admonition> (jsx:Admonition type="info" title="Info") (type:info, title:Info)Use info admonitions for information that's sufficiently important that it needs to stand apart from the rest of the text.}(/jsx:Admonition)Use info admonitions for information that's sufficiently important that it needs to stand apart from the rest of the text.</Admonition> (jsx:Admonition type="caution" title="Caution") (type:caution, title:Caution)Use caution admonitions when something may prevent an intended action from being completed.}(/jsx:Admonition)Use caution admonitions when something may prevent an intended action from being completed.</Admonition> (jsx:Admonition type="danger" title="Warning") (type:danger, title:Warning)Use warning admonitions when there is a risk of injury, security breach or data loss.}(/jsx:Admonition)Use warning admonitions when there is a risk of injury, security breach or data loss.</Admonition>
fr: # Admonitions Le composant **Admonitions** vous permet d'ajouter des avertissements stylisés. 1. Sélectionnez **Admonition** dans la liste **Embed**. 2. Modifiez le composant et sélectionnez un **Type** (**Note**, **Conseil**, **Info**, **Caution** ou **Warning**). 3. Donnez-lui un **Title**. 4. Saisissez le **Content**. #### Exemples : <Admonition type="note" title="Note" children={Utilisez les admonitions de note pour obtenir des informations supplémentaires.}>Utilisez les admonitions de note pour obtenir des informations supplémentaires.</Admonition> <Admonition type="tip" title="Conseil" children={Utilisez les avertissements de type "tip" pour fournir des conseils qu'il est prudent d'ignorer.}>Utilisez les avertissements de type "tip" pour fournir des conseils qu'il est prudent d'ignorer.</Admonition> <Admonition type="info" title="Info" children={Utilisez les avertissements de type "info" pour les informations suffisamment importantes pour se démarquer du reste du texte.}>Utilisez les avertissements de type "info" pour les informations suffisamment importantes pour se démarquer du reste du texte.</Admonition> <Admonition type="caution" title="Prudence" children={Utilisez les avertissements de prudence lorsque quelque chose risque d'empêcher la réalisation d'une action prévue.}>Utilisez les avertissements de prudence lorsque quelque chose risque d'empêcher la réalisation d'une action prévue.</Admonition> <Admonition type="danger" title="Avertissement" children={Utilisez des avertissements lorsqu'il existe un risque de blessure, de violation de la sécurité ou de perte de données.}>Utilisez des avertissements lorsqu'il existe un risque de blessure, de violation de la sécurité ou de perte de données.</Admonition>

# advanced
source: This section covers the more advanced features of DocStatic including integrations: (jsx:DocCardList title="Advanced guides") (title:Advanced guides)(/jsx:DocCardList) Developers who are interested in extending the functionality of DocStatic should refer to the Guides and Advanced Guides in the Docusaurus documentation.
fr: Cette section couvre les fonctionnalités plus avancées de DocStatic, y compris les intégrations : <DocCardList title="Advanced guides"></DocCardList> Les développeurs intéressés par l'extension des fonctionnalités de DocStatic doivent se référer aux Guides et aux Tutoriels avancés dans la documentation de Docusaurus.

# cli
source: DocStatic provides a set of scripts to help you generate, serve, and deploy your website. ## DocStatic CLI commands To invoke the commands, use yarn. For example, yarn dev. These commands are described in CLI in the Docusaurus documentation: - docusaurus - start - build - swizzle - deploy - clear - serve - write-translations - write-heading-ids ### Automated commands These commands are run automatically at build time or when starting the dev server: - generate-files - prebuild - predev ### API commands - clean-api-docs - gen-api-docs - gen-graphql For more information on the OpenAPI commands, refer to CLI Usage in the Docusaurus OpenAPI Plugin documentation. For more information on the GraphQL command, refer to Usage in the Docusaurus GraphQL Plugin documentation. ### Linting commands For more information about the linting commands, refer to CLI in the Biome documentation.
fr: DocStatic fournit un ensemble de scripts pour vous aider à générer, servir et déployer votre site web. ## Commandes CLI de DocStatic Pour invoquer les commandes, utilisez yarn. Par exemple, yarn dev. Ces commandes sont décrites dans CLI dans la documentation de Docusaurus : - docusaurus - start - build - swizzle - deploy - clear - serve - write-translations - write-heading-ids ### Commandes automatisées Ces commandes sont exécutées automatiquement au moment de la construction ou lors du démarrage du serveur de développement : - generate-files - prebuild - predev ### Commandes API - clean-api-docs - gen-api-docs - gen-graphql Pour plus d'informations sur les commandes OpenAPI, reportez-vous à CLI Usage) dans la documentation Docusaurus OpenAPI Plugin. Pour plus d'informations sur la commande GraphQL, voir Usage dans la documentation du plugin GraphQL de Docusaurus. ### Commandes d'archivage Pour plus d'informations sur les commandes de classement, voir CLI dans la documentation de Biome.

# test
source: ## Passthrough component (jsx:Passthrough summary="Check List" string="- [X] 1\n^- [X] 2\n^^- [X] 3\n- [ ] 4") (summary:Check List, string:- [X] 1\n^- [X] 2\n^^- [X] 3\n- [ ] 4)(/jsx:Passthrough) ## GFM list - 1- 2- 3 - 4 ## Bullet list - 1- 2- 3 - 4
fr: ## Passthrough component <Passthrough summary="Check List" string="- [X] 1\n^- [X] 2\n^^- [X] 3\n- [ ] 4"></Passthrough> ## GFM list - 1- 2- 3 - 4 ## Bullet list - 1- 2- 3 - 4

# guides/markdown-features/code-blocks
source: # Code blocks and snippets DocStatic provides two ways to include code in your documentation. Both support syntax highlighting. ## Code blocks 1. Click the **Code Block** icon in the rich text editor. 2. Click the language list and select or search for a language. 3. Enter your code in the box. #### Example: ## Code snippets 1. Select **Code Snippet** from the **Embed** list. 2. Give it a **Title**. 3. Select a **Language**. 4. Choose a file from the list. The list is populated with all the files in the reuse/code/ folder every time you run the dev server or do a build. #### Example: (jsx:CodeSnippet title="Example Title" language="xml" filepath="example.xml") (title:Example Title, language:xml, filepath:example.xml)(/jsx:CodeSnippet) The advantage of using code snippets is that there is a physical file that can be unit tested.
fr: # Blocs de code et extraits DocStatic propose deux façons d'inclure du code dans votre documentation. Toutes deux prennent en charge la mise en évidence de la syntaxe. ## Blocs de code 1. Cliquez sur l'icône **Code Block** dans l'éditeur de texte riche. 2. Cliquez sur la liste des langues et sélectionnez ou recherchez une langue. 3. Saisissez votre code dans la boîte. #### Exemple : ## Extraits de code 1. Sélectionnez **Code Snippet** dans la liste **Embed**. 2. Donnez-lui un **Title**. 3. Sélectionnez une **Language**. 4. Choisissez un fichier dans la liste. La liste est remplie avec tous les fichiers du dossier reuse/code/ chaque fois que vous lancez le serveur de développement ou que vous faites une compilation. #### Exemple : <CodeSnippet title="Titre de l'exemple" language="xml" filepath="example.xml"></CodeSnippet> L'avantage d'utiliser des extraits de code est qu'il existe un fichier physique qui peut être testé de manière unitaire.

# guides/markdown-features/conditional-text
source: # Conditional text The **Conditional Text** component enables you to wrap conetnt in a set of conditions that determine when it should be displayed: - Conditions can be any combination of languages or user-defined conditions. - The content can be displayed or hidden if one or more conditions are met (OR) or only if all conditions are met (AND). You can also specify fallback text to display if no conditions are met. ## Create categories and conditions 1. In the CMS, click the **Conditions** collection. 2. Click the **Add** icon to add a new **Category** 3. Give it a **Name** and **Description**. 4. For each **Condition** you want to add:1. Click the **Add** icon. 2. Name the **Condition** and give it a **Description**. 3. Toggle the **Active** status of the condition as required. ## Add conditions to a topic Conditions are set at the topic level. The language is determined by the page language. Other conditions are defined as an array in the metadata at the start of the topic. 1. Create or edit a topic. 2. In the **Conditions** area, expand the **Categories** and select the box of any **Conditions** you want to apply to the topic. ## Add conditional text 1. Select **Conditional Text** from the **Embed** list. 2. Edit the component. 3. Enter the **Content**. 4. Set the **Action** (show or hide). 5. Add any **Required Conditions**. 6. Add any **Required Languages**. 7. Set the **Condition Logic**. 8. Set the **Language Logic**. 9. Select if both conditions and languages are required. 10. (Optional) Enter the **Fallback Text**. ### Example (jsx:ConditionalText action="show" conditions={production} languages={} logic="any" languageLogic="any" requireBothConditions=false fallback="") (action:show, logic:any, languageLogic:any)The production condition is set on this page.}(/jsx:ConditionalText)The production condition is set on this page.</ConditionalText>
fr: # Texte conditionnel Le composant **Conditions** vous permet d'envelopper du texte dans un ensemble de conditions qui déterminent quand il doit être affiché. Les conditions peuvent être n'importe quelle combinaison de langues ou de conditions définies par l'utilisateur. Le texte peut être affiché si une ou plusieurs conditions sont remplies (OR) ou seulement si toutes les conditions sont remplies (AND). Vous pouvez également spécifier un texte de remplacement à afficher si aucune condition n'est remplie. ## Créer des catégories et des conditions 1. Dans le CMS, cliquez sur la collection **Conditions**. 2. Cliquez sur l'icône **Add** pour ajouter une nouvelle **Category** 3. Donnez-lui un **Name** et une **Description**. 4. Pour chaque **Condition** que vous souhaitez ajouter :1. Cliquez sur l'icône **Add**. 2. Nommez la **Condition** et donnez-lui une **Description**. 3. Faites basculer le statut **Active** de la condition si nécessaire. ## Ajouter des conditions à une rubrique Les conditions sont définies au niveau de la rubrique. La langue est déterminée par la langue de la page. Les autres conditions sont définies sous forme de tableau dans les métadonnées au début du sujet. 1. Créez ou modifiez une rubrique. 2. Dans la zone **Conditions**, développez les **Categories** et cochez la case des **Conditions** que vous souhaitez appliquer au sujet. ## Ajouter un texte conditionnel 1. Sélectionnez **Conditional Text** dans la liste **Embed**. 2. Modifiez le composant. 3. Saisissez le **Text Content**. 4. Ajoutez les **Required Conditions**. 5. Ajoutez les **Required Languages**. 6. Définissez la **Condition Logic**. 7. Définissez la **Language Logic**. 8. Sélectionnez si les deux conditions et les deux langues sont requises. 9. (Facultatif) Saisissez le **Fallback Text**.

# configuration
source: # Configuration DocStatic site configuration is managed through the docusaurus.config.ts file. For information about editing this file directly, refer to Configuration in the Docusaurus documentation. To use the CMS to edit the configuration, navigate to the **Settings** collection. From here, you can configure the site's: - **Title**. - **Tagline**. - **Favicon**. - **GraphQL Schema URL**. - Default **Color Mode** (dark or light). - **Footer** items. - **Languages**. - **Logo**. - **OpenAPI** schemas. - **Syntax Highlighting**. - **URL**. - **Navbar**. - **Sidebar** settings. - **Blog** settings. There is a separate **Theme** collection for changing the color scheme and typography settings.
fr: # Configuration La configuration du site DocStatic est gérée par le fichier docusaurus.config.ts. Pour plus d'informations sur l'édition directe de ce fichier, reportez-vous à Configuration dans la documentation de Docusaurus. Pour utiliser le CMS afin de modifier la configuration, naviguez vers la collection Settings. À partir de là, vous pouvez configurer le logo du site, le titre, l'accroche et le pied de page.

# guides/markdown-features/context-help
source: # Context-sensitive help > "Context-sensitive help is a kind of > online help > that is obtained from a specific point in the state of the software, providing help for the situation that is associated with that state. Context-sensitive help, as opposed to general online help or online manuals, does not need to be accessible for reading as a whole. Each topic is supposed to describe extensively one state, situation, or feature of the software."— > Wikipedia Typically, context-sensitive help is implemented by having a help icon that users can click that will take them to the appropriate part of the documentation for the part of the software they are using. This involves creating a map of context URLs. The static site generator automatically generates links to headings. However, if you change the heading, the link will change. For this reason, DocStatic provides the Context Help element. It enables you to add an anchor tag anywhere within a topic. Providing that a slug is defined for the topic in the metadata, the link will not break. 1. Select **Context Help** from the Embed list. 2. Enter a unique ID. The link will be in the form: <URL>/docs/<slug>#<id>. #### Examlpe https://docstatic.com/docs/context-help#help-example <a id="help-example"></a> ## Developers For an example of how to include context help links in your code, examine the HelpButton React component in the source code for this site. Because DocStatic doesn't have direct access to the CMS code, it implements the button by applying it as a UI element on an unused field in a CMS collection. The HelpButton component attaches the button to the nav element on the page and links it to the URL passed in the template:
fr: # Aide contextuelle > "L'aide contextuelle est un type d' > aide en ligne > qui est obtenu à partir d'un point spécifique de l'état du logiciel, fournissant de l'aide pour la situation qui est associée à cet état. L'aide contextuelle, contrairement à l'aide en ligne générale ou aux manuels en ligne, n'a pas besoin d'être accessible à la lecture dans son ensemble. Chaque rubrique est censée décrire de manière exhaustive un état, une situation ou une fonctionnalité du logiciel." - > Wikipedia En règle générale, l'aide contextuelle est mise en œuvre au moyen d'une icône d'aide sur laquelle l'utilisateur peut cliquer et qui l'amène à la partie de la documentation correspondant à la partie du logiciel qu'il utilise. Cela implique la création d'une carte des URL contextuelles. Le générateur de site statique génère automatiquement des liens vers les titres. Cependant, si vous modifiez le titre, le lien changera. C'est pourquoi DocStatic fournit l'élément Aide contextuelle. Il vous permet d'ajouter une balise d'ancrage n'importe où dans un sujet. À condition qu'une balise soit définie pour le sujet dans les métadonnées, le lien ne sera pas rompu. 1. Sélectionnez **Context Helpe** dans la liste **Embed**. 2. Saisissez un identifiant unique. Le lien se présentera sous la forme suivante : <URL>/docs/<slug>#<id> : <URL>/docs/<slug>#<id>. #### Exemple https://docstatic.com/docs/fr/context-help#help-example <a id="help-example"></a> ## Développeurs Pour un exemple de la façon d'inclure des liens d'aide contextuelle dans votre code, examinez le composant React HelpButton dans le code source de ce site. DocStatic n'ayant pas d'accès direct au code du CMS, il implémente le bouton en l'appliquant en tant qu'élément d'interface utilisateur sur un champ inutilisé dans une collection du CMS. Le composant HelpButton attache le bouton à l'élément nav de la page et le lie à l'URL passée dans le modèle :

# guides/docs/create-doc
source: # Create a doc In DocStatic, you write your content as Markdown in files called “Topics”. Typically, you will create each topic yourself, although certain types of docs may have autogenerated topics. (jsx:Admonition type="note" title="Note") (type:note, title:Note)GraphQL and OpenAPI docs are autogenerated from a server or schema.}(/jsx:Admonition)GraphQL and OpenAPI docs are autogenerated from a server or schema.</Admonition> To create a topic: 1. From the **Topics** collection, click **Add File**. 2. Give the topic a **Title**. 3. (Optional) If you want to use the topic in context-sensitive help, give it a **Slug**. This is a fixed path from /docs/. 4. Give the topic a **Description**. This is displayed in the Doc Card List. 5. (Optional) Add any required taxonomy **Tags**. 6. (Optional) Set any **Conditions**. 7. Make sure the Workflow status is set to **Draft**. 8. Enter your content. 9. Click **Save**. ## Doc front matter At the start of every topic is a section of YAML contained between two sets of three hyphens (---). DocStatic uses this for things such as: - Conditional Text - Taxonomies (doc tags) - Workflows For more information, refer to Create a doc in the Docusaurus documentation.
fr: # Créer un document Dans DocStatic, vous écrivez votre contenu en Markdown dans des fichiers appelés "Topics". En règle générale, vous créez vous-même chaque sujet, bien que certains types de documents puissent avoir des sujets autogénérés. <Admonition type="note" title="Note" children={Les documents GraphQL et OpenAPI sont autogénérés à partir d'un serveur ou d'un schéma.}>Les documents GraphQL et OpenAPI sont autogénérés à partir d'un serveur ou d'un schéma.</Admonition> Pour créer un sujet : 1. Dans la collection **Topics**, cliquez sur **Add File**. 2. Donnez un **Title** à la rubrique. 3. (Facultatif) Si vous souhaitez utiliser la rubrique dans l'aide contextuelle, offrez-lui un **Slug**. Il s'agit d'un chemin fixe à partir de /docs/. 4. Offrez à la rubrique une **Description**. Celle-ci est affichée dans la liste des cartes de documents. 5. (Facultatif) Ajoutez les **Tags** de la taxonomie. 6. (Facultatif) Définir les **Conditions**. 7. Assurez-vous que le statut du flux de travail est défini sur **Draft**. 8. Saisissez votre contenu. 9. Cliquez sur **Save**. ## Document recto Au début de chaque sujet se trouve une section de YAML contenue entre deux séries de trois traits d'union (---). DocStatic l'utilise pour des choses telles que : - Texte conditionnel - Taxonomies (étiquettes de documents) - les flux de travail Pour plus d'informations, voir Créer un doc dans la documentation de Docusaurus.
