Repository: aowendev/docstatic
Catalog: *-translations.xlf
Languages: fr

# guides/dashboards
source: DocStatic adds dashboard functionality to TinaCMS. Tina generates a GraphQL API using the filesystem in the Git repository as the database. Dashboards query the API (locally or in the cloud) and present actionable reports directly in the CMS. Dashboard functionality is currently considered beta. The functionality is fully tested, but the user interface is provisional and requires refinement. Dashboards update when the page is updated. If another user has made changes since you viewed a dashboard, you can click **Refresh** to update the dashboard. (jsx:Admonition type="note" title="Note") (type:note, title:Note)Depending on the amount of content in the system, some dashboards may take some time to load. These dashboards will typically update slightly faster when running locally.}(/jsx:Admonition)Depending on the amount of content in the system, some dashboards may take some time to load. These dashboards will typically update slightly faster when running locally.</Admonition> ## Viewing the dashboards From the CMS, navigate to the Dashboards collection. At the top of the page is a status bar that shows the GraphQL connection. It indicates if you are connected to the cloud or localhost. If the localhost is available, it will always connect to the localhost. To use the cloud, ensure the local dev server is stopped. The status bar also displays the environment and checks all settings are valid. ## Viewing workflow status The Content Overview dashboard show the total number of topics in the /docs path and the topics in each workflow status: - Draft - Review - Translate - Approved - Published - Unlisted Click the status link to display all topics in that status. Click Edit to open the topic for editing. Click the Close icon to close the list of topics. ### Viewing recent activity The Recent Activity section shows recently changed topics. You can filter the time range (All time, Last week or Last month) and set the number of results from 5 to 50. ## Viewing translation status The Translations dashboard shows the status of each topic for the language selected from the list: - Up to date: The last modified date of the translation is later than the source. - Outdated: The last modified date of the source is later than the translation. - Missing: There is a source file with no equivalent translation file. ## Viewing media reuse The Media Library dashboard shows where content in the /static/img path is used. It shows the total number of files and images, file size, image paths and image sizes. You can filter by: - All content. - Images only. - Recent (7 days). - Used. - Unused. For used content, click Used in n docs to display the topics where the content is used. You can then click Edit to edit those topics. ## Checking broken links The Broken Links dashboard validates all the hyperlinks in the topics. The report includes number for: - Total links. - Valid links where a connection could be established. - Broken links where no connection could be established. - Warning links where the connecton was rejected but the link could still be valid. You can safely ignore warnings about http://localhost if you are describing software running locally. But document links should be relative. Warnings are typically the results of aggressive CORS/CORP policies that do not respect no-cors settings. You must manually validate these sites by clicking the hyperlink. The dashboard lists files with problem links. You can open them by clicking Edit in either list. The dashboard also provides a summary with the date when the report was run.
fr: DocStatic adds dashboard functionality to TinaCMS. Tina generates a GraphQL API using the filesystem in the Git repository as the database. Dashboards query the API (locally or in the cloud) and present actionable reports directly in the CMS. Dashboard functionality is currently considered beta. The functionality is fully tested, but the user interface is provisional and requires refinement. Dashboards update when the page is updated. If another user has made changes since you viewed a dashboard, you can click **Refresh** to update the dashboard. <Admonition type="note" title="Note" children={Depending on the amount of content in the system, some dashboards may take some time to load. These dashboards will typically update slightly faster when running locally.}>Depending on the amount of content in the system, some dashboards may take some time to load. These dashboards will typically update slightly faster when running locally.</Admonition> ## Viewing the dashboards From the CMS, navigate to the Dashboards collection. At the top of the page is a status bar that shows the GraphQL connection. It indicates if you are connected to the cloud or localhost. If the localhost is available, it will always connect to the localhost. To use the cloud, ensure the local dev server is stopped. The status bar also displays the environment and checks all settings are valid. ## Viewing workflow status The Content Overview dashboard show the total number of topics in the /docs path and the topics in each workflow status: - Draft - Review - Translate - Approved - Published - Unlisted Click the status link to display all topics in that status. Click Edit to open the topic for editing. Click the Close icon to close the list of topics. ### Viewing recent activity The Recent Activity section shows recently changed topics. You can filter the time range (All time, Last week or Last month) and set the number of results from 5 to 50. ## Viewing translation status The Translations dashboard shows the status of each topic for the language selected from the list: - Up to date: The last modified date of the translation is later than the source. - Outdated: The last modified date of the source is later than the translation. - Missing: There is a source file with no equivalent translation file. ## Viewing media reuse The Media Library dashboard shows where content in the /static/img path is used. It shows the total number of files and images, file size, image paths and image sizes. You can filter by: - All content. - Images only. - Recent (7 days). - Used. - Unused. For used content, click Used in n docs to display the topics where the content is used. You can then click Edit to edit those topics. ## Checking broken links The Broken Links dashboard validates all the hyperlinks in the topics. The report includes number for: - Total links. - Valid links where a connection could be established. - Broken links where no connection could be established. - Warning links where the connecton was rejected but the link could still be valid. You can safely ignore warnings about http://localhost if you are describing software running locally. But document links should be relative. Warnings are typically the results of aggressive CORS/CORP policies that do not respect no-cors settings. You must manually validate these sites by clicking the hyperlink. The dashboard lists files with problem links. You can open them by clicking Edit in either list. The dashboard also provides a summary with the date when the report was run.

# deployment
source: By default, DocStatic deploys to GitHub Pages. For other options, refer to Deployment in the Docusaurus documentation.
fr: Par défaut, DocStatic se déploie sur GitHub Pages. Pour d'autres options, voir Déploiement dans la documentation de Docusaurus.

# guides/markdown-features/diagrams
source: # Diagrams Diagrams can be rendered using Mermaid in a code block. ## Use The CMS directly supports editing Mermaid diagrams. 1. Click the **Mermaid** icon. 2. Enter the Markdown in the box. Click **Preview** to view your diagram. #### Example: (jsx:Admonition type="note" title="Note") (type:note, title:Note)Currently, zenUML diagrams are not supported and mind map diagrams may produce unusual behavior. Not all diagram types can be previewed in the CMS.}(/jsx:Admonition)Currently, zenUML diagrams are not supported and mind map diagrams may produce unusual behavior. Not all diagram types can be previewed in the CMS.</Admonition> For more information, refer to Mermaid in the TinaCMS documentation. For information on theming Mermaid, refer to Diagrams in the Docusaurus documentation.
fr: # Diagrammes Les diagrammes peuvent être rendus avec Mermaid dans un bloc de code. ## Utiliser Le CMS prend directement en charge l'édition des diagrammes Mermaid. 1. Cliquez sur l'icône **Mermaid**. 2. Entrez le Markdown dans la boîte. Cliquez sur **Examen** pour visualiser votre diagramme. #### Exemple : <Admonition type="note" title="Note" children={Actuellement, les diagrammes zenUML ne sont pas pris en charge et les diagrammes de cartes heuristiques peuvent produire un comportement inhabituel. Tous les types de diagrammes ne peuvent pas être prévisualisés dans le CMS.}>Actuellement, les diagrammes zenUML ne sont pas pris en charge et les diagrammes de cartes heuristiques peuvent produire un comportement inhabituel. Tous les types de diagrammes ne peuvent pas être prévisualisés dans le CMS.</Admonition> Pour plus d'informations, reportez-vous à Mermaid dans la documentation de TinaCMS. Pour plus d'informations sur la thématisation de Mermaid, voir Diagrammes dans la documentation de Docusaurus.

# guides/docs/introduction
source: # Docs introduction The docs feature provides you with a way to organize Markdown files in a hierarchical format. (jsx:Admonition type="info" title="Info") (type:info, title:Info)Refer to Docs Plugin API Reference in the Docusaurus documentation for an exhaustive list of options.}(/jsx:Admonition)Refer to Docs Plugin API Reference in the Docusaurus documentation for an exhaustive list of options.</Admonition> For information on configuring docs-only or blog-only modes, refer to Docs introduction in the Docusaurus documentation. (jsx:DocCardList title="Docs") (title:Docs)(/jsx:DocCardList)
fr: # Docs introduction La fonctionnalité docs permet d'organiser les fichiers Markdown dans un format hiérarchique. <Admonition type="info" title="Info" children={Reportez-vous à Docs Plugin API Reference dans la documentation de Docusaurus pour une liste exhaustive des options.}>Reportez-vous à Docs Plugin API Reference dans la documentation de Docusaurus pour une liste exhaustive des options.</Admonition> Pour plus d'informations sur la configuration des modes “docs-only” ou “blog-only”, voir Introduction des docs dans la documentation de Docusaurus. <DocCardList title="Docs"></DocCardList>

# guides/markdown-features/footnotes
source: # Footnotes There is an extension to Markdown that provides footnotes, but its implementation is not consistent and it separates the content from the number. For example: In DocStatic this would be represented as: The **Footnotes** component enables you add inline footnotes to your text. 1. Select **Footnotes** from the **Embed** list. 2. Edit the component. 3. Give it a **Summary**. 4. Enter the **Footnote**. #### Example Markdown is a lightweight markup language(jsx:Footnote summary="1") (summary:1) Markdown uses simple syntax to achieve text formatting.}(/jsx:Footnote) Markdown uses simple syntax to achieve text formatting.</Footnote> created by John Gruber(jsx:Footnote summary="2") (summary:2)John Gruber created Markdown in 2004.}(/jsx:Footnote)John Gruber created Markdown in 2004.</Footnote>, now widely used in writing(jsx:Footnote summary="3") (summary:3)Many platforms such as GitHub, Stack Overflow, and blog platforms support Markdown.}(/jsx:Footnote)Many platforms such as GitHub, Stack Overflow, and blog platforms support Markdown.</Footnote>. (jsx:Admonition type="note" title="Note") (type:note, title:Note)If two footnotes have the same content, they will only appear once in the footer and will share a number.}(/jsx:Admonition)If two footnotes have the same content, they will only appear once in the footer and will share a number.</Admonition>
fr: # Notes de bas de page Il existe une extension de Markdown qui fournit des notes de bas de page, mais sa mise en œuvre n'est pas cohérente et elle sépare le contenu du numéro. Par exemple : Dans DocStatic, cela serait représenté par : Le composant **Footnotes** vous permet d'ajouter des notes de bas de page en ligne à votre texte. 1. Sélectionnez **Footnotes** dans la liste **Embed**. 2. Modifiez le composant. 3. Donnez-lui un **Summary**. 4. Saisissez la **Footnote**. #### Exemple Markdown est un langage de balisage léger<Footnote summary="1" children={ Markdown utilise une syntaxe simple pour réaliser le formatage du texte.}> Markdown utilise une syntaxe simple pour réaliser le formatage du texte.</Footnote> créé par John Gruber<Footnote summary="2" children={John Gruber a créé Markdown en 2004.}>John Gruber a créé Markdown en 2004.</Footnote>, aujourd'hui largement utilisé dans la rédaction<Footnote summary="3" children={De nombreuses plateformes telles que GitHub, Stack Overflow, et des plateformes de blogs prennent en charge Markdown.}>De nombreuses plateformes telles que GitHub, Stack Overflow, et des plateformes de blogs prennent en charge Markdown.</Footnote>. <Admonition type="note" title="Note" children={Si deux notes de bas de page ont le même contenu, elles n'apparaîtront qu'une seule fois dans le pied de page et partageront un numéro.}>Si deux notes de bas de page ont le même contenu, elles n'apparaîtront qu'une seule fois dans le pied de page et partageront un numéro.</Admonition>
