Repository: aowendev/docstatic
Catalog: *-translations.xlf
Languages: fr

# guides/markdown-features/tabs
source: The **Tabs** component enables you to add tabbed content to your topic. 1. Select **Tabs** from the **Embed** list. 2. Edit the component. 3. For each tab:1. Select **Tab Item** from the **Embed** list. 2. Give it a **Value**. 3. Give it a **Title**. 4. Enter the **Content**. 5. (Optional) Make it the **Default** tab. 4. **Save** your changes. (jsx:Admonition type="danger" title="Warning") (type:danger, title:Warning)The CMS can lose context when editing tabs. You should save often. The CMS can get into a position where it cannot find the context of the tab. In this case click the **Raw Markdown** icon and make changes directly in the Markdown. Save and then return to the rich text editor.}(/jsx:Admonition)The CMS can lose context when editing tabs. You should save often. The CMS can get into a position where it cannot find the context of the tab. In this case click the **Raw Markdown** icon and make changes directly in the Markdown. Save and then return to the rich text editor.</Admonition> #### Example: (jsx:Tabs This is an apple 🍎</TabItem> (jsx:TabItem label="Orange" value="orange") (label:Orange, value:orange)This is an orange 🍊(/jsx:TabItem)This is an orange 🍊</TabItem> (jsx:TabItem label="Banana" value="banana") (label:Banana, value:banana)This is a banana 🍌(/jsx:TabItem)This is a banana 🍌</TabItem>})(jsx:TabItem label="Apple" value="apple") (label:Apple, value:apple)This is an apple 🍎(/jsx:TabItem)This is an apple 🍎</TabItem> (jsx:TabItem label="Orange" value="orange") (label:Orange, value:orange)This is an orange 🍊(/jsx:TabItem)This is an orange 🍊</TabItem> (jsx:TabItem label="Banana" value="banana") (label:Banana, value:banana)This is a banana 🍌(/jsx:TabItem)This is a banana 🍌</TabItem>}(/jsx:Tabs)(jsx:TabItem label="Apple" value="apple") (label:Apple, value:apple)This is an apple 🍎}(/jsx:TabItem)This is an apple 🍎</TabItem> (jsx:TabItem label="Orange" value="orange") (label:Orange, value:orange)This is an orange 🍊}(/jsx:TabItem)This is an orange 🍊</TabItem> (jsx:TabItem label="Banana" value="banana") (label:Banana, value:banana)This is a banana 🍌}(/jsx:TabItem)This is a banana 🍌</TabItem></Tabs> For more information, refer to Tabs in the Docusaurus documentation.
fr: Le composant **Tabs** vous permet d'ajouter des onglets à votre sujet. 1. Sélectionnez **Tabs** dans la liste **Embed**. 2. Modifiez le composant. 3. Pour chaque onglet :1. Sélectionnez **Tab Item** dans la liste **Embed**. 2. Donnez-lui une **Value**. 3. Donnez-lui un **Title**. 4. Saisissez le **Content**. 5. (Facultatif) Faites-en l'onglet **Default**. 4. **Save** vos modifications. <Admonition type="danger" title="Warning" children={Le CMS peut perdre le contexte lors de la modification des onglets. Vous devez sauvegarder souvent. Le CMS peut se retrouver dans une position où il ne peut pas trouver le contexte de l'onglet. Dans ce cas, cliquez sur l'icône **Markdown brut** et apportez des modifications directement dans le Markdown. Sauvegardez et revenez ensuite à l'éditeur de texte riche.}>Le CMS peut perdre le contexte lors de la modification des onglets. Vous devez sauvegarder souvent. Le CMS peut se retrouver dans une position où il ne peut pas trouver le contexte de l'onglet. Dans ce cas, cliquez sur l'icône **Markdown brut** et apportez des modifications directement dans le Markdown. Sauvegardez et revenez ensuite à l'éditeur de texte riche.</Admonition> #### Exemple : <Tabs children={<TabItem label="Pomme" value="apple" children={Ceci est une pomme 🍎}>Ceci est une pomme 🍎</TabItem> <TabItem label="Orange" value="orange" children={Ceci est une orange 🍊}>Ceci est une orange 🍊</TabItem> <TabItem label="Banane" value="banane" children={Ceci est une banane 🍌}>Ceci est une banane 🍌</TabItem>}><TabItem label="Pomme" value="apple" children={Ceci est une pomme 🍎}>Ceci est une pomme 🍎</TabItem> <TabItem label="Orange" value="orange" children={Ceci est une orange 🍊}>Ceci est une orange 🍊</TabItem> <TabItem label="Banane" value="banane" children={Ceci est une banane 🍌}>Ceci est une banane 🍌</TabItem></Tabs> Pour plus d'informations, voir Onglets dans la documentation de Docusaurus.

# migration
source: # Upgrading While DocStatic is still in early development, changes must be merged individually from the main repository. However, the Node.js components can safely be updated by replacing the package.json file with the latest version from the main repository. After updating, run:
fr: # Mise à niveau DocStatic étant encore au début de son développement, les modifications doivent être fusionnées individuellement à partir du dépôt principal. Cependant, les composants Node.js peuvent être actualisé en toute sécurité en remplaçant le fichier package.json par la dernière version du dépôt principal. Après la mise à jour, exécutez :

# using-plugins
source: The static site generator core doesn't provide any feature of its own. All features are delegated to individual plugins: the docs feature provided by the docs plugin; the blog feature provided by the blog plugin; or individual pages provided by the pages plugin. DocStatic is preconfigured to use the plugins required to support: - KaTeX math equations - Lunr search - Mermaid diagrams - OpenAPI docs - GraphQL docs For more information, refer to Using Plugins in the Docusaurus documentation.
fr: Le noyau du générateur de sites statiques ne fournit aucune fonctionnalité propre. Toutes les fonctionnalités sont déléguées à des plugins individuels : la fonctionnalité docs fournie par le plugin docs ; la fonctionnalité blog fournie par le plugin blog ; ou les pages individuelles fournies par le plugin pages. DocStatic est préconfiguré pour utiliser les plugins nécessaires au support : - équations mathématiques KaTeX - Recherche Lunr - Diagrammes Mermaid - Documents OpenAPI - docs GraphQL Pour plus d'informations, voir Utilisation de Plugins) dans la documentation de Docusaurus.

# guides/wikis
source: # Wikis A wiki page is a web/documentation page that's designed for collaboration. They are easy to create and edit and are often used for internal team knowledge sharing as well as public-facing help content. When working with wiki topics in the CMS: - Create wiki topics in the /docs/wiki/ folder. - You don't need to add the wiki topics to the table of contents. The sidebar for wiki topics is generated automatically, based on the file structure in the repo. - Wiki topics do not include metadata. DocStatic can automatically link a category to its index document. A category index document is a document following this filename convention: Named as README (case-insensitive): docs/wiki/folder/readme.mdx. For more information, refer to Autogenerated in the Docusaurus documenation. ## Create a wiki page in the CMS 1. Select the **Wiki Pages** collection. 2. Click **Add File**.(jsx:Figure img="/img/docs/wiki-pages-add-wiki.png" caption="TinaCMS. A callout highlights the Wiki option and the Add file option.") (img:/img/docs/wiki-pages-add-wiki.png, caption:TinaCMS. A callout highlights the Wiki option and the Add file option.)(/jsx:Figure) 3. Give your new wiki page a **Title**. 4. Enter the content. 5. Click **Save**.
fr: # Wikis Une page wiki est une page web/documentation conçue pour la collaboration. Elles sont faciles à créer et à modifier et sont souvent utilisées pour le partage des connaissances au sein de l'équipe interne ainsi que pour le contenu d'aide destiné au public. Lorsque vous travaillez avec des sujets wiki dans le CMS : - Créez les rubriques wiki dans le dossier /docs/wiki/. - Il n'est pas nécessaire d'ajouter les rubriques wiki à la table des matières. La barre latérale des rubriques wiki est générée automatiquement, en fonction de la structure des fichiers dans le répertoire. - Les sujets wiki n'incluent pas de métadonnées. DocStatic peut automatiquement lier une catégorie à son document d'index. Un document d'index de catégorie est un document qui suit cette convention de nom de fichier : Nommé comme README (insensible à la casse) : docs/wiki/folder/readme.mdx. Pour plus d'informations, voir Autogénéré dans la documentation de Docusaurus. ## Créer une page wiki dans le CMS 1. Sélectionnez la collection **Wiki Pages**. 2. Cliquez sur **Add File**.<Figure img="/img/docs/wiki-pages-add-wiki.png" caption="TinaCMS. Un callout met en évidence l'option Wiki et l'option Add File."></Figure> 3. Donnez un **Title** à votre nouvelle page wiki. 4. Saisissez le contenu. 5. Cliquez sur **Save**.
