Repository: aowendev/docstatic
Catalog: *-translations.xlf
Languages: fr

# installation
source: # Installation Welcome! This guide walks you through setting up DocStatic for the first time. If you’ve never worked with GitHub or docs-as-code before, don’t worry — we’ll explain what’s needed, why, and where to find more detail. ## Prerequisites You can run DocStatic locally (on your computer) or host it in the cloud. For the easiest cloud setup, create free accounts with these services: - GitHub — stores your content and tracks changes - TinaCMS — enables browser-based editing - LanguageTool — provides optional grammar and style checking If you plan to run DocStatic locally (on your computer) instead, see the Requirements for local development. --- ## Requirements for local development This section only applies if you plan to work locally. You'll need an Integrated Development Environment (IDE) or a text editor. Two open-source options are: - Eclipse - VSCodium You will also need to install Node.js for its build tools and Yarn for package management. ### Install Node.js You need to install Node.js version 18.0 or above. Check if Node.js is already installed. Open a terminal (Command Prompt or Terminal app) and run: If you see a version number starting with v18 or higher, you're good to go. If Node.js is not installed or you have an older version: 1. Go to the official Node.js downloads page. 2. Choose the LTS (Long-Term Support) version for your operating system.The installer includes npm, the Node Package Manager, which you'll need in later steps.During installation:* Keep the default options selected (these include required dependencies) * When the installer finishes, close and reopen your terminal. 3. (Optional) if you work on different projects that need different Node versions, install nvm (Node Version Manager). With nvm, you can switch between versions of Node without breaking your setup. ### Install Yarn DocStatic uses Yarn for package management. Check if Yarn is already installed. Open your terminal or command prompt and type: If you see a version number, Yarn is already installed. If you get a “command not found” message or similar error, open a terminal (Command Prompt or Terminal app) and run: (jsx:Admonition type="note" title="Note") (type:note, title:Note)On macOS or Linux, you might need to prefix the command with sudo to grant permission: }(/jsx:Admonition)On macOS or Linux, you might need to prefix the command with sudo to grant permission: </Admonition> (jsx:Admonition type="note" title="Note") (type:note, title:Note)On Windows, you don’t use sudo. Just open your terminal as Administrator and run the command.}(/jsx:Admonition)On Windows, you don’t use sudo. Just open your terminal as Administrator and run the command.</Admonition> --- ## Get the DocStatic repository DocStatic’s source code lives on GitHub. To start, you’ll need to make your own copy by: 1. **Create a fork** of the DocStatic repository Forking creates a copy that you can use to work independently on your own project. 2. **Create a clone** of your fork. Cloning makes a copy that is associated with the original fork that you made. This can be useful for fixing schema issues, should they occur later. ### Fork the DocStatic repository 1. Log in to your account in GitHub. 2. Visit https://github.com/aowendev/docstatic. 3. Click Fork (it is usually to the top-right). 4. Leave the default Repository name in place. 5. Enter a description of your project. 6. Make sure Copy the main branch only is checked. 7. Click Create fork. GitHub makes a new branch of the repository in your GitHub account. ### Clone your fork of the DocStatic repository To create a clone: 1. Log in to your GitHub account. 2. Navigate to the repository for the fork. 3. Click on the repository to open it. 4. Click on **<> Code** and then copy the url. 5. Open your terminal or command prompt and use cd to navigate to the location where you want to store the clone. For example, cd Documents/Projects/. 6. Enter git clone followed by the url of your clone. --- ## Install the project dependencies If you're going to work locally, you also need to install the project dependencies. Use cd to navigate to the root folder of your cloned or forked DocStatic repository and install the packages: Yarn will download everything listed in package.json. This may take a few minutes. --- ## Project structure After forking or cloning the repository, you will see various files in your in your docstatic/ folder. Below, we've included **some** of the project structure files and folders that you need to be aware of. **It is not a complete list of everything in the project**. ### Project structure rundown - /apis/ - OpenAPI YAML files. - /blog/ - Blog MDX files. - /config/ - JSON files used by TinaCMS to configure DocStatic. - /docs/ - Docs MDX files. - /i18n/ - Translation files. - /reuse/ - Reusable content. - /src/ - Non-documentation files like pages or custom React components.- /src/pages - Any JSX/TSX/MDX file within this directory are converted into a website page. - /static/ - Static folder. Any content inside here is copied into the root of the final build folder. - /docusaurus.config.ts - A config file containing the site configuration. - /package.json - A DocStatic website is a React app. You can install and use any npm packages you want. - /sidebars.ts - Specifies the order of documents in the sidebar. Use this for your “table of contents” structure. --- ### Monorepos DocStatic allows the use of a single repo that contains both the project code and the project documentation. In Docusaurus terminology, this concept is called a “monorepo”. For more information, see Monorepos in the Docusaurus documentation. --- ### Preview changes To preview your changes as you edit the files, you can run a **local development server** that will serve your website and reflect the latest changes. Open a terminal or command prompt and enter: By default, a browser window will open at http://localhost:3000. --- ### Build DocStatic uses a static site generator to build the website into a folder of static contents and put it on a web server where it can be viewed. To build the website, use: The contents are generated in the /build folder, which you can copy to any static file hosting service such as GitHub pages, Netlify or Vercel. For more information, refer to Deployment in the Docusaurus documentation.
fr: # Installation Pour commencer, créez et clonez le Dépôt DocStatic. ## Prérequis Il est possible d'utiliser DocStatic localement ou de configurer votre propre déploiement hébergé. Cependant, pour un déploiement dans le nuage le plus facile possible, vous pouvez vous inscrire à des comptes avec : - GitHub - TinaCMS - LanguageTool ## Exigences Pour le développement local, vous devez installer un IDE. Deux options libres et gratuites sont disponibles : - Eclipse - VSCodium DocStatic consiste en un ensemble de paquets Node.js. Vous aurez besoin de la version 18.0 ou supérieure (qui peut être vérifiée en lançant node -v). Vous pouvez utiliser nvm pour gérer plusieurs versions de Node.js sur une seule machine. Lors de l'installation de Node.js, vous devez cocher toutes les cases relatives aux dépendances. Yarn est utilisé pour la gestion des paquets. Les responsables de Yarn recommandent d'installer Yarn globalement en utilisant le gestionnaire de paquets NPM, qui est inclus par défaut dans toutes les installations de Node.js. Utilisez le drapeau -g avec npm install pour le faire : Ensuite, allez à la racine du dossier docstatic/ et installez les dépendances : ## Structure du projet Après avoir cloné le dépôt, vous verrez ces fichiers dans le dossier docstatic/ : Cette liste n'est pas exhaustive, mais il s'agit des principaux éléments à prendre en compte. ### Aperçu de la structure du projet - /apis/ - Fichiers OpenAPI YAML. - /blog/ - Fichiers MDX pour les blogs. - /config/ - Fichiers JSON utilisés par TinaCMS pour configurer DocStatic. - /docs/ - Fichiers MDX Docs. - /i18n/ - Fichiers de traduction. - /reuse/ - Contenu réutilisable. - /src/ - Fichiers non-documentaires comme les pages ou les composants React personnalisés.- /src/pages - Tout fichier JSX/TSX/MDX dans ce répertoire est converti en page web. - /static/ - Dossier statique. Tout le contenu qu'il contient est copié à la racine du dossier de construction final. - /docusaurus.config.ts - Un fichier de configuration contenant la configuration du site. - /package.json - Un site web DocStatic est une application React. Vous pouvez installer et utiliser tous les paquets npm que vous souhaitez. - /sidebars.ts - Spécifie l'ordre des documents dans la barre latérale. ### Monorepos Si vous utilisez DocStatic pour la documentation d'un projet existant, une monorepo peut être la solution pour vous. Pour plus d'informations, voir Monorepos dans la documentation de Docusaurus. ### Exécution du serveur de développement Pour prévisualiser vos modifications au fur et à mesure que vous éditez les fichiers, vous pouvez lancer un serveur de développement local qui servira votre site web et reflétera les dernières modifications. Par défaut, une fenêtre de navigateur s'ouvrira à l'adresse http://localhost:3000. ### Build DocStatic utilise un générateur de site statique pour construire le site web dans un dossier de contenu statique et le placer sur un serveur web où il peut être visualisé. Pour créer le site web : et le contenu sont générés dans le dossier /build, qui peut être copié sur n'importe quel service d'hébergement de fichiers statiques comme les pages GitHub, Netlify ou Vercel. Pour plus d'informations, voir Déploiement dans la documentation de Docusaurus.

# i18n/introduction
source: # Internationalization Internationalization (i18n) support is provided by the static site generator. For detailed information, refer to i18n - Introduction in the Docusuarus documentation. ## Edit translated docs in the CMS 1. From the **Translations** collection, select the document you want to edit. 2. Make your changes 3. Set the **Document Status** to **In Translation** or **Translation Approved** as required. 4. Click **Save**.
fr: # Internationalisation La prise en charge de l'internationalisation (i18n) est assurée par le générateur de sites statiques. Pour des informations détaillées, voir i18n - Introduction dans la documentation de Docusuarus. ## Editer les documents traduits dans le CMS 1. Dans la collection **Translations**, sélectionnez le document que vous souhaitez éditer. 2. Effectuez vos modifications 3. Réglez le **Document Status** sur **In Traduction** ou **Translation Approved** selon le cas. 4. Cliquez sur **Save**.

# introduction
source: DocStatic is a modern documentation platform that bridges the gap between writers and developers to help you create online documentation your users will love. It simultaneously provides the best features of component content management systems and docs-as-code solutions for online documentation. With DocStatic, anyone on your team can create and edit your documents without sacrificing your developer workflow. ## Features DocStatic is a refinement of Tinasaurus, an open-source React-based project that combines a static site generator (Docusaurus) with a headless content management system (TinaCMS). It includes: - An easy-to-use editing interface for Markdown, MDX, JSON, and YAML content. - Integration with existing Git and CI/CD workflows. - Embedded MDX components. - Media manager with support for third-party media providers. - Editing in the cloud (no local setup required). ## Easy content management DocStatic's default collections include some of the more advanced authoring features you'd expect to find in a CCMS. The rich text editor makes it easy to add: - Conditional text, snippets, and variable sets for content reuse - Taxonomies - Glossary terms - Code blocks, comments, collapsible details, figure, footnotes, and tabs. These are available as templates that you can insert into a content file. The CMS uses a GraphQL schema to describe the shape of your content as a set of collections. ## Git-backed Source control, automation and, optionally, publishing are managed through GitHub. When editing files with the rich-text editor, TinaCMS either commits on save or saves directly to the file if working locally. Git remains the source of truth for the whole team. The repository structure is very similar to the Docusaurus defaults, but with some changes required for integration with TinaCMS. ## Preconfigured plugins DocStatic is preconfigured with plugins supporting features such as KaTeX equations, Lunr search, Mermaid diagrams and OpenAPI docs. There is built-in support for internationalization (i18n). Multilingual spelling, grammar and, optionally, style checking are provided by LanguageTool through browser and IDE plugins. ## React-based Content is stored in MDX format—an extension to Markdown that supports custom React components for features such as admonitions. These components are available universally and do not need to be declared in individual files. When working locally, the dev server instantly recompiles pages when you save your changes. ## Fully documented Developers will find all the information they need to configure and start using DocStatic in the Docusaurus and TinaCMS documentation. That information is not duplicated here, to avoid the possibility of it becoming out of date. Instead, the DocStatic documentation focuses on using the CMS.
fr: DocStatic est une plateforme de documentation moderne qui comble le fossé entre les rédacteurs et les développeurs pour vous aider à créer une documentation en ligne que vos utilisateurs aimeront. Elle offre simultanément les meilleures caractéristiques des solutions de documentation en ligne systèmes de gestion de contenu de composants et docs-as-code. Il permet à n'importe quel membre de votre équipe de créer et d'éditer vos documents sans sacrifier le flux de travail de vos développeurs. DocStatic a été créé comme une amélioration de Tinasaurus, un projet open-source basé sur React qui combine un générateur de site statique (Docusaurus) avec un système de gestion de contenu sans tête (TinaCMS). Il comprend : - Une interface d'édition pour les contenus Markdown, MDX, JSON et YAML. - Intégration avec les flux de travail Git et CI/CD existants. - Composants MDX intégrés. - Gestionnaire de médias avec prise en charge de fournisseurs de médias tiers. - Édition dans le nuage (aucune installation locale n'est nécessaire). ## Soutenu par Git Le contrôle des sources, l'automatisation et, éventuellement, la publication sont gérés par GitHub). La structure du dépôt est très similaire aux valeurs par défaut de Docusaurus, mais avec quelques changements nécessaires pour l'intégration avec TinaCMS. Lors de l'édition de fichiers avec l'éditeur de texte riche, TinaCMS s'engage lors de l'enregistrement ou enregistre directement dans le fichier si l'on travaille localement. Git reste la source de vérité pour toute l'équipe. ## Basé sur React Le contenu est stocké au format MDX - une extension de Markdown qui prend en charge les composants React personnalisés pour des fonctionnalités telles que les remontrances. Ces composants sont disponibles de manière universelle et n'ont pas besoin d'être déclarés dans des fichiers individuels. Lorsque vous travaillez en local, le serveur de développement recompile instantanément les pages lorsque vous enregistrez vos modifications. ## Gestion facile du contenu Le CMS utilise un schéma GraphQL pour décrire la forme de votre contenu comme un ensemble de collections. Les collections par défaut de DocStatic comprennent du texte conditionnel, des termes de glossaire, des extraits, des taxonomies et des ensembles de variables. Le CMS définit des composants qui peuvent être intégrés en tant que modèles, ce qui les rend disponibles dans l'éditeur de texte enrichi. Les modèles par défaut de DocStatic comprennent les blocs de code, les commentaires, les détails repliables, les figures, les notes de bas de page et les onglets. ## Plugins préconfigurés DocStatic est préconfiguré avec des plugins prenant en charge des fonctionnalités telles que KaTeX équations, Lunr recherche, Mermaid diagrammes et OpenAPI docs. Il existe un support intégré pour l'internationalisation (i18n). La vérification multilingue de l'orthographe, de la grammaire et, éventuellement, du style est assurée par LanguageTool au moyen de plugins pour navigateur et IDE. ## Entièrement documenté Les développeurs trouveront toutes les informations dont ils ont besoin pour configurer et commencer à utiliser DocStatic dans la documentation de Docusaurus et de TinaCMS. Ces informations ne sont pas reproduites ici, afin d'éviter qu'elles ne deviennent obsolètes. La documentation de DocStatic se concentre plutôt sur l'utilisation du CMS.

# guides/markdown-features/plugins
source: # MDX plugins MDX has a built-in plugin system that can be used to customize how Markdown files are parsed and transformed to JSX. However, if you change the way Markdown behaves, you must also reflect these changes in the CMS. (jsx:Admonition type="danger" title="Warning") (type:danger, title:Warning)MDX plugins that change the behavior of standard Markdown components may break compatibility with the CMS. Proceed at your own risk.}(/jsx:Admonition)MDX plugins that change the behavior of standard Markdown components may break compatibility with the CMS. Proceed at your own risk.</Admonition> For more information, refer to MDX Plugins in the Docusaurus documentation. (jsx:Admonition type="note" title="Note") (type:note, title:Note)DocStatic preinstalls and configures the math plugins for you.}(/jsx:Admonition)DocStatic preinstalls and configures the math plugins for you.</Admonition>
fr: # Plugins MDX MDX dispose d'un système de plugins intégré qui peut être utilisé pour personnaliser la façon dont les fichiers Markdown sont analysés et transformés en JSX. Cependant, si vous modifiez la manière dont Markdown se comporte, vous devez également refléter ces changements dans le CMS. <Admonition type="danger" title="Avertissement" children={Les plugins MDX qui modifient le comportement des composants Markdown standard peuvent rompre la compatibilité avec le CMS. Procédez à vos risques et périls.}>Les plugins MDX qui modifient le comportement des composants Markdown standard peuvent rompre la compatibilité avec le CMS. Procédez à vos risques et périls.</Admonition> Pour plus d'informations, voir Plugins MDX dans la documentation de Docusaurus. <Admonition type="note" title="Note" children={DocStatic préinstalle et configure les plugins mathématiques pour vous.}>DocStatic préinstalle et configure les plugins mathématiques pour vous.</Admonition>
