Repository: aowendev/docstatic
Catalog: *-translations.xlf
Languages: fr

# guides/markdown-features/intro
source: # Markdown features DocStatic uses Markdown as its main content authoring format. You can learn it in ten minutes. But you don't have to because the CMS provides a full rich text editing environment for metadata, Markdown and React components. ## Simple Structured Authoring Topics in DocStatic have three parts: - Metadata (in YAML format) - Content (in Markdown) - Predefined React components. The CMS makes sure metadata and Markdown are used consistently, while the React components provide a uniform style and support for content reuse features. You don’t need to add any JSX code yourself as the components are already available globally. ## Standard features Markdown features include: - Bold, code, italic and strikethrough character styles. - Bulleted and numbered lists. - Code blocks. - Heading levels (1 to 6). - Horizontal rules. - Images. - Links. - Quotes. - Simple tables. These can all be selected directly from the rich text toolbar in the CMS. To these, Docusaurus adds: - Admonitions - Details (expanding content) - Doc card lists - Tabs DocStatic further extends this with: - Code snippets (from files) - Comments - Conditional text - Context help links - Diagrams - Figures - Footnotes - Glossary terms - Math equations - Snippets - Variables ## Front matter Front matter is used to add metadata to your Markdown file. It's provided at the very top of the file, enclosed by three dashes ---. Content plugins may have their own front matter schema. DocStatic uses the front matter for: - Conditions (for conditional text) - Descriptions - Slugs (fixed paths) - Taxonomy tags - Titles - Workflow status ## Details 1. Select **Details** from the **Embed** list. 2. Edit the component. 3. Give it a **Summary**. 4. Enter the **Details**. #### Example: (jsx:Details summary="Toggle me.") (summary:Toggle me.)This is the detailed content. You can use Markdown here including **bold** and _italic_ text, and inline links.}(/jsx:Details)This is the detailed content. You can use Markdown here including **bold** and _italic_ text, and inline links.</Details> ## Doc card lists Doc card lists are automatically generated for categories in the table of contents. However, you can also manually add them to a topic. 1. Select **Doc Card List** from the **Embed** list. 2. Give it a **Title**. For more information, refer to Markdown Features in the Docusarus documentation. #### Example: (jsx:DocCardList title="Markdown Features") (title:Markdown Features)(/jsx:DocCardList)
fr: # Fonctionnalités de Markdown DocStatic utilise Markdown comme principal format de création de contenu. Vous pouvez l'apprendre en dix minutes. Mais vous n'avez pas à le faire car le CMS fournit un environnement d'édition de texte riche complet pour les métadonnées, Markdown et les composants React. ## Rédaction structurée simple Les sujets dans DocStatic ont trois parties : - Métadonnées (au format YAML) - Contenu (en Markdown) - Composants React prédéfinis. Le CMS s'assure que les métadonnées et le format Markdown sont utilisés de manière cohérente, tandis que les composants React fournissent un style uniforme et prennent en charge les fonctions de réutilisation du contenu. Vous n'avez pas besoin d'ajouter du code JSX vous-même car les composants sont déjà disponibles globalement. ## Fonctionnalités standard Les fonctionnalités Markdown incluent : - Styles de caractères gras, code, italique et barré. - Listes numérotées et à puces. - Blocs de code. - Niveaux de titres (1 à 6). - Règles horizontales. - Images. - Liens. - Citations. - Tableaux simples. Tous ces éléments peuvent être sélectionnés directement à partir de la barre d'outils "texte riche" du CMS. A cela, Docusaurus ajoute : - Admonitions - Détails (expansion du contenu) - Listes de fiches doc - Onglets DocStatic étend encore ce système avec : - Extraits de code (depuis fichiers) - Commentaires - Texte conditionnel - Liens d'aide contextuelle - Diagrammes - Figures - Notes de bas de page - Glossaire - Équations mathématiques - Bribes d'information - Variables ## Première page La page de garde est utilisée pour ajouter des métadonnées à votre fichier Markdown. Il est fourni tout en haut du fichier, entouré de trois tirets ---. Les plugins de contenu peuvent avoir leur propre schéma de contenu. DocStatic utilise la matière première pour : - Les conditions (pour le texte conditionnel) - Les descriptions - Slugs (chemins d'accès fixes) - Balises de taxonomie - Titres - Statut du flux de travail ## Détails 1. Sélectionnez **Details** dans la liste **Embed**. 2. Modifiez le composant. 3. Donnez-lui un **Summary**. 4. Saisissez les **Details**. #### Exemple : <Details summary="Toggle me." children={Il s'agit du contenu détaillé. Vous pouvez utiliser Markdown ici, y compris le texte en **gras** et _italique_, et les [liens] en ligne (https://docusaurus.io/).}>Il s'agit du contenu détaillé. Vous pouvez utiliser Markdown ici, y compris le texte en **gras** et _italique_, et les [liens] en ligne (https://docusaurus.io/).</Details> ## Listes de cartes document Les listes de fiches sont générées automatiquement pour les catégories de la table des matières. Toutefois, vous pouvez également les ajouter manuellement à une rubrique. 1. Sélectionnez **Doc Card List** dans la liste **Embed**. 2. Offrez-lui un **Title**. Pour plus d'informations, voir Fonctionnalités Markdown dans la documentation de Docusarus. #### Exemple : <DocCardList title="Fonctionnalités Markdown"></DocCardList>

# guides/markdown-features/links
source: # Markdown links There are two ways of adding a link to another page: through a URL path or a file path. In the CMS you can add a link from the pasteboard by selecting a section of text and pasting it. You can also highlight a section of text and click the Link icon to add a path. Or you can place the cursor where you want the link to appear, click the icon and enter the path and the display text. For more information on links refer to Markdown links in the Docusuarus documenation.
fr: # Liens Markdown Il existe deux façons d'ajouter un lien vers une autre page : par un chemin d'URL ou par un chemin de fichier. Dans le CMS, vous pouvez ajouter un lien à partir du bloc-notes en sélectionnant une section de texte et en la collant. Vous pouvez également mettre en évidence une section de texte et cliquer sur l'icône Lien pour ajouter un chemin d'accès. Vous pouvez aussi placer le curseur à l'endroit où vous souhaitez que le lien apparaisse, cliquer sur l'icône et saisir le chemin et le texte d'affichage. Pour plus d'informations sur les liens, voir Liens Markdown dans la documentation Docusuarus.

# guides/markdown-features/math-equations
source: # Math equations Mathematical equations can be rendered using KaTeX. ## Use To use KaTeX from the CMS, embed the string in a **Passthrough** component. You can include a **Summary** that will appear inline when editing the topic. ### Inline Write inline math equations by wrapping LaTeX equations between $: (jsx:Passthrough type="markdown" string="Let $f\\colon[a,b] \\to \\R$ be Riemann integrable. Let $F\\colon[a,b]\\to\\R$ be $F(x) (type:markdown)=\\int_{a}^{x} f(t)\\,dt$. Then $F$ is continuous, and at all $x$ such that $f$ is continuous at $x$, $F$ is differentiable at $x$ with $F'(x)=f(x)$." summary="inline equation")(/jsx:Passthrough) ### Blocks For equation block or display mode, use line breaks and $$: (jsx:Passthrough type="markdown" string="\n$$\nI = \\int_0^{2\\pi} \\sin(x) (type:markdown)\\,dx\n$$\n" summary="block equation")(/jsx:Passthrough) For more information, refer to the KaTeX documentation.
fr: # Équations mathématiques Les équations mathématiques peuvent être rendues avec KaTeX. ## Utiliser Pour utiliser KaTeX à partir du CMS, intégrez la chaîne dans un composant **Passthrough**. Vous pouvez inclure un **Summary** qui apparaîtra en ligne lors de l'édition du sujet. ### Incliné Écrire des équations mathématiques en ligne en enveloppant les équations LaTeX entre $ : <Passthrough type="markdown" string="Let $f\\colon[a,b] \\to \\R$ be Riemann integrable. Soit $F\\colon[a,b]\\to\\R$ $F(x)=\\int_{a}^{x} f(t)\\N,dt$. Alors $F$ est continue, et pour tout $x$ tel que $f$ est continue en $x$, $F$ est différentiable en $x$ avec $F'(x)=f(x)$." summary="inline equation"></Passthrough> ### Blocs Pour le bloc d'équation ou le mode d'affichage, utilisez les sauts de ligne et $$ : <Passthrough type="markdown" string="\n$$\nI = \\int_0^{2\\pi} \\sin(x)\\,dx\n$$\n" summary="block equation"></Passthrough> Pour plus d'informations, consultez la documentation KaTeX.

# advanced/notifications
source: # Notifications DocStatic uses GitHub Actions to send workflow notifications. Example review and translate notifications are included in the .github/workflows/ folder. Some configuration in GitHub is required to enable them. You can also use them as the starting point to develop your own custom notifications. ## Email The email-review.yml and email-translate.yml actions are triggered when either the review or translate tags are set on a markdown file in the main branch. To use them, add these secrets to your repository: - SMTP_SERVER - SMTP_PORT - SMTP_USERNAME - SMTP_PASSWORD - NOTIFY_EMAIL_TO - NOTIFY_EMAIL_FROM You can get this information from your email provider. For example: - iCloud (requires an app-specific-password). - Outlook ## Slack The slack-review.yml and slack-translate.yml actions use the same triggers as the email versions. To use them, add your Slack webhook URL as a secret named SLACK_WEBHOOK_URL. For more information, refer to Sending messages using incoming webhooks in the Slack documentation. ## Teams The teams-review.yml and teams-translate.yml actions work like the Slack versions. Microsoft is deprecating the **Incoming Webhooks** app for Teams from December 2025, but currently there isn't a publicly available GitHub method for sending Adaptive Cards to workflows. The workaround is to use curl: 1. In Teams, go to the channel you want to send messages, click the elipsis (**…**) and select **Workflows**. 2. Click **Manage**. 3. Click **New Flow**. 4. Search templates for webhooks and click **Send webhook alerts to a channel**. 5. (Optional) Edit the **Flow name**. 6. Sign in and click **Next**. 7. Select a **Team** and **Channel** from the lists and click **Create Flow**. 8. Copy the MS_TEAMS_HTTP_POST_URL and store it as a secret in GitHub and click **Done**. (jsx:Admonition type="tip" title="Tip") (type:tip, title:Tip)You can use the Test notifications GitHub action to test your connections.}(/jsx:Admonition)You can use the Test notifications GitHub action to test your connections.</Admonition>
fr: # Notifications DocStatic utilise GitHub Actions pour envoyer des notifications de flux de travail. Des exemples de notifications de révision et de traduction sont inclus dans le dossier .github/workflows/. Une configuration dans GitHub est nécessaire pour les activer. Vous pouvez également les utiliser comme point de départ pour développer vos propres notifications personnalisées. ## Email Les actions email-review.yml et email-translate.yml sont déclenchées lorsque les balises review ou translate sont définies sur un fichier markdown dans la branche principale. Pour les utiliser, ajoutez ces secrets à votre dépôt : - SMTP_SERVER - SMTP_PORT - SMTP_USERNAME - SMTP_PASSWORD - NOTIFY_EMAIL_TO - NOTIFY_EMAIL_FROM Vous pouvez obtenir cette information auprès de votre fournisseur de messagerie. Par exemple, vous pouvez obtenir cette information auprès de votre fournisseur de messagerie : - iCloud (nécessite un [mot de passe spécifique à l'application])(https://support.apple.com/en-us/102654)). - Outlook ## Slack Les actions slack-review.yml et slack-translate.yml utilisent les mêmes déclencheurs que les versions email. Pour les utiliser, ajoutez l'URL de votre webhook Slack en tant que secret nommé SLACK_WEBHOOK_URL. Pour plus d'informations, consultez Sending messages using incoming webhooks dans la documentation de Slack. ## Équipes Les actions teams-review.yml et teams-translate.yml fonctionnent comme les versions Slack. Microsoft supprime l'application **Incoming Webhooks** pour Teams à partir de décembre 2025, mais il n'y a actuellement pas de méthode GitHub publiquement disponible pour envoyer des cartes adaptatives à des flux de travail. La solution consiste à utiliser curl : 1. Dans Teams, accédez au canal dans lequel vous souhaitez envoyer des messages, cliquez sur l'ellipse (**...**) et sélectionnez **Workflows**. 2. Cliquez sur **Mange**. 3. Cliquez sur **New flow**. 4. Recherchez des modèles pour les webhooks et cliquez sur **Send webhook alerts to a channel**. 5. (Facultatif) Modifiez le **Flow name**. 6. Connectez-vous et cliquez sur **Next**. 7. Sélectionnez une **Team** et un **Channel** dans les listes et cliquez sur **Create Flow**. 8. Copiez le MS_TEAMS_HTTP_POST_URL et stockez-le en tant que secret dans GitHub et cliquez sur **Done**. <Admonition type="tip" title="Conseil" children={Vous pouvez utiliser l'action GitHub Test notifications pour tester vos connexions.}>Vous pouvez utiliser l'action GitHub Test notifications pour tester vos connexions.</Admonition>

# search
source: By default, DocStatic is configured to use Lunr search. Its main advantage is that it's a zero cost solution. Its main disadvantage is that the entire search index is downloaded to the user's browser; the larger your site gets, the slower it gets. A variety of alternatives are available as Docusaurus plugins, including: - Algolia (pre-installed) - Markprompt - Meilisearch - Orama - Typesense DocSearch For more information, refer to Search in the Docusaurus documentation.
fr: Par défaut, DocStatic est configuré pour utiliser la recherche Lunr. Son principal avantage est qu'il s'agit d'une solution à coût nul. Son principal inconvénient est que l'index de recherche complet est téléchargé dans le navigateur de l'utilisateur ; plus votre site est volumineux, plus il est lent. Diverses alternatives sont disponibles sous forme de plugins Docusaurus, notamment : - Algolia (pré-installé) - Markprompt - Meilisearch - Orama - Typesense DocSearch Pour plus d'informations, voir Search dans la documentation de Docusaurus.

# seo
source: DocStatic supports search engine optimization in various ways: - Global metadata - Human readable links - Image meta description - Rich search information - Robots file - Single page metadata - Sitemap file - Structured content For more information, refer to the Search engine optimization in the Docusaurus documentation.
fr: DocStatic soutient l'optimisation des moteurs de recherche de différentes manières : - Métadonnées globales - Liens lisibles par l'homme - Méta description de l'image - Informations de recherche riches - Fichier robots - Métadonnées de page unique - Fichier Sitemap - Contenu structuré Pour plus d'informations, reportez-vous à la section Optimisation des moteurs de recherche dans la documentation de Docusaurus.

# guides/markdown-features/snippets
source: # Snippets The **Snippet** component enables you to reuse content across your documentation. A snippet is a chunk of content that can be inserted inside one or more topics. When you make changes to the snippet, they are made wherever the snippet is used. This can be particularly useful for boilerplate text. Snippets have their own collection in the CMS and are contained in their own separate part of the repository. 1. Select the **Snippet** component from the **Embed** list. 2. Edit the component. 3. Choose a file from the list. The list is populated with all the files in the /reuse/snippets/ folder) every time you run the dev server or do a build. #### Example (jsx:Snippet filepath="example.mdx") (filepath:example.mdx)(/jsx:Snippet)
fr: # Snippets Le composant **Snippet** vous permet de réutiliser du contenu dans votre documentation. Un extrait est un morceau de contenu qui peut être inséré dans une ou plusieurs rubriques. Lorsque vous apportez des modifications à l'extrait, elles sont apportées partout où l'extrait est utilisé. Cela peut s'avérer particulièrement utile pour les textes passe-partout. Les snippets ont leur propre collection dans le CMS et sont contenus dans une partie distincte du référentiel. 1. Sélectionnez le composant **Snippet** dans la liste **Embed**. 2. Modifiez le composant. 3. Saisissez le **Path** du snippet (dans le dossier /reuse/snippets/). #### Exemple <Snippet filepath="example.mdx"></Snippet>

# static-assets
source: Static assets are the non-code files that are directly copied to the build output. They include images, stylesheets, favicons, fonts, and so on You should put these assets in the static folder. Every file you put into that folder is copied into the root of the generated build folder with the folder hierarchy preserved. For example, if you add a file named sun.jpg to the static folder, it will be copied to build/sun.jpg. This means that: - For site baseUrl: '/', the image /static/img/sun.jpg will be served at /img/sun.jpg. - For site baseUrl: '/subpath/', the image /static/img/sun.jpg will be served at /subpath/img/sun.jpg. ## Referencing your static asset ### In the CMS 1. Insert a Link. 2. Enter the absolute path, for example /files/note.docx. 3. Enter the text to display. ### In Markdown For more information, refer to Static Assets in the Docusaurus documentation.
fr: Les ressources statiques sont les fichiers non codés qui sont directement copiés dans la sortie de la compilation. Ils comprennent les images, les feuilles de style, les favicons, les polices de caractères, etc. Vous devez placer ces ressources dans le dossier static. Chaque fichier que vous placez dans ce dossier est copié à la racine du dossier de compilation généré, en conservant la hiérarchie des dossiers. Par exemple, si vous ajoutez un fichier nommé sun.jpg dans le dossier statique, il sera copié dans build/sun.jpg. Cela signifie que : - Pour le site baseUrl : '/', l'image /static/img/sun.jpg sera servie à /img/sun.jpg. - Pour le site baseUrl : '/subpath/', l'image /static/img/sun.jpg sera servie à /subpath/img/sun.jpg. ## Référencement de votre ressource statique ### Dans le CMS 1. Insérez un lien. 2. Saisissez le chemin absolu, par exemple /files/note.docx. 3. Saisissez le texte à afficher. ### En Markdown Pour plus d'informations, voir Ressources statiques dans la documentation de Docusaurus.

# advanced/style
source: # Style checking One of the features most missed by writers working in docs-as-code is a good spelling, grammar and style checker. By default, spell-checking is provided by your web browser or integrated development environment. This may be adequate for simple websites, but if you need something more advanced then you need a dedicated grammar checker. ## LanguageTool DocStatic is tested with LanguageTool, an AI-based grammar checker that supports over 20 languages. It's free to register for the basic plan. The premium plan adds style-guide support for individuals and teams. Tailored businesses plans are available. There is also a discount for students and non-profits. ## Self hosted Because LanguageTool is open-source, you have the option of self-hosting. In this case there are no subscription fees, but you will need a development team to set up your LanguageTool instance, and you'll have to provide your own support.
fr: # Contrôle du style L'une des fonctionnalités qui manque le plus aux rédacteurs travaillant dans des documents comme code est un bon correcteur d'orthographe, de grammaire et de style. Par défaut, le correcteur orthographique est fourni par votre navigateur web ou votre environnement de développement intégré. Cela peut suffire pour des sites web simples, mais si vous avez besoin de quelque chose de plus avancé, il vous faut un vérificateur de grammaire dédié. ## LanguageTool DocStatic a été testé avec LanguageTool, un correcteur grammatical établi sur l'intelligence artificielle qui prend en charge plus de 20 langues. L'inscription à l'offre originelle est gratuite (https://languagetool.org/fr/register). Le plan premium ajoute la prise en charge des guides de style pour les individus et les équipes. Des plans sur mesure pour les entreprises sont disponibles. Il existe également une réduction pour les étudiants et les organisations à but non lucratif. ## Auto-hébergé LanguageTool étant un logiciel libre, vous pouvez de l'auto-héberger. Dans ce cas, aucuns frais n'existent d'abonnement. Vous aurez besoin d'une équipe de développement pour mettre en place votre instance de LanguageTool, et vous devrez assurer votre propre support.

# styling-layout
source: A DocStatic site is a single-page React application. You can style it the way you style React apps. ## Global styles DocStatic uses the @docusaurus/preset-classic theme with CSS overrides in the /src/css/custom.css file. Any CSS you write in that file is available globally and can be referenced directly using string literals. ## Styling your site with Infima DocStatic uses Infima as the underlying styling framework. Infima provides a flexible layout and common UI components styling suitable for content-centric websites (blogs, documentation, home pages). For more details, refer to the Infima website. Infima uses seven shades of each color. We recommend using ColorBox to find the different shades of colors for your chosen primary color. You can use the tool on the Example page to generate the different shades for your website and copy the variables into /src/css/custom.css. ## Dark mode In light mode, the <html> element has a data-theme="light" attribute; in dark mode, it's data-theme="dark". Therefore, you can scope your CSS to dark-mode-only by targeting html with a specific attribute. ## Mobile view Docstatic uses 996px as the cutoff between mobile screen width and desktop. If you want your layout to be different in the mobile view, you can use media queries. For more information, refer to Styling and Layout in the Docusaurus documentation.
fr: Un site DocStatic est une application React à page unique. Vous pouvez le styliser de la même manière que les applications React. ## Styles globaux DocStatic utilise le thème @docusaurus/preset-classic avec des surcharges CSS dans le fichier /src/css/custom.css. Toute CSS que vous écrivez dans ce fichier est disponible globalement et peut être référencée directement à l'aide de chaînes de caractères. ## Styliser votre site avec Infima DocStatic utilise Infima comme cadre de style sous-jacent. Infima fournit une mise en page flexible et des composants d'interface utilisateur communs adaptés aux sites web centrés sur le contenu (blogs, documentation, pages d'atterrissage). Pour plus de détails, consultez le site web Infima. Infima utilise sept nuances de chaque couleur. Nous vous recommandons d'utiliser ColorBox pour trouver les différentes nuances de couleurs pour la couleur primaire que vous avez choisie. Vous pouvez utiliser l'outil de la Page d'exemple pour générer les différentes nuances pour votre site web et copier les variables dans /src/css/custom.css. ## Mode sombre En mode clair, l'élément <html> a un attribut data-theme="light" ; en mode sombre, il est data-theme="dark". Par conséquent, vous pouvez adapter votre CSS au mode sombre uniquement en ciblant l'élément html avec un attribut spécifique. ## Vue mobile Docstatic utilise 996px comme limite entre la largeur de l'écran mobile et celle de l'écran de bureau. Si vous voulez que votre mise en page soit différente dans l'affichage mobile, vous pouvez utiliser des requêtes de média. Pour plus d'informations, voir Style et mise en page dans la documentation de Docusaurus.
